Revit 2027 API
WorksetDefaultVisibilitySettings.IsWorksetVisible Method
 Indicates whether the workset is visible by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsWorksetVisible(
	WorksetId worksetId
)
Public Function IsWorksetVisible (
	worksetId As WorksetId
) As Boolean
public:
bool IsWorksetVisible(
	WorksetId^ worksetId
)
member IsWorksetVisible :
        worksetId : WorksetId -> bool
Parameters
worksetId WorksetId
 Id of the workset.
Return Value
Boolean
 Whether the workset is visible by default.
Exceptions
Exception | Condition
ArgumentException |  There is no workset with this Id in the document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  WorksetDefaultVisibilitySettings is not applicable to family documents.
See Also
Reference
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace